{"mushroom_name":{"0":"01_Volvariella_volvacea","1":"02_Schizophyllum_commune","2":"03_Lentinula_edodes","3":"04_Auricularia_auricula-judae","4":"05_Auricularia_polytricha","5":"06_Agaricus_bisporus","6":"07_Pleurotus_pulmonarius","7":"08_Ganoderma_lucidum","8":"09_Tylopilus_felleus","9":"10_Pleurotus_ostreatus","10":"11_Boletus_edulis","11":"12_Tremella_fuciformis","12":"13_Hericium_erinaceus","13":"14_Macrolepiota_albuminosa","14":"15_Cantharellus_cibarius","15":"16_Hypsizygus_tessellatus","16":"17_Pleurotus_eryngii","17":"18_Amanita_verna","18":"19_Amanita_virosa","19":"20_Amanita_phalloides","20":"21_Chlorophyllum_molybdites","21":"22_Lepiota_brunneoincarnata","22":"23_Amanita_muscaria","23":"24_Entoloma_sinuatum","24":"25_Panaeolus_papilionaceus","25":"26_Inocybe_rimosa","26":"27_Coprinus_atramentarius","27":"28_Psilocybe_semilanceata","28":"29_Amanita_pantherina","29":"30_Galerina_marginata","30":"31_Pholiotina_rugosa","31":"32_Scleroderma_citrinum","32":"33_Gyromitra_esculenta"},"text_description":{"0":"Volvariella bombycina, Straw mushroom. Edible mushroom. Benefits: antioxidant, anti-cancer. 5-20cm white bell-shaped, white free gills, stem: white, volva, Brownish pink spores. Habitat: Hardwood, late spring to fall.","1":"Schizophyllum commune, Common Porecrust. Edible mushroom. Benefits: anti-cancer, antitumor, antioxidant. 1-5cm whitish fan-shaped, whitish split gills, White spores. Habitat: Hardwood, year-round.","2":"Lentinula edodes, Shiitake mushroom. Edible mushroom. Benefits: immune support, anti-cancer, antiviral. 5-15cm tan to brown umbrella-shaped, whitish adnexed gills, stem: whitish to cream, White spores. Habitat: Hardwood, warm and moist forests.","3":"Auricularia auricula-judae, Black wood ear. Edible mushroom. Benefits: antibacterial, antitumor, antioxidant. up to 9cm purplish-brown ear-shaped, absent, White spores. Habitat: Hardwood, year-round.","4":"Auricularia polytricha, Cloud ear fungus. Edible mushroom. Benefits: antioxidant, antimicrobial. dark yellowish-brown, hairy, absent, stem: absent or very short. Habitat: Wood, moist forests.","5":"Agaricus bisporus, Button mushroom. Edible mushroom. Benefits: antioxidant, immune support, anti-inflammatory. 2.5-14cm white or brown convex, pink to black free gills, stem: white, ring, Dark brown spores. Habitat: Grasslands, after rain.","6":"Pleurotus pulmonarius, Indian Oyster. Edible mushroom. Benefits: anti-inflammatory, antitumor, antioxidant. 3-10cm whitish fan-shaped, whitish decurrent gills, stem: whitish, eccentric or lateral, White to gray or lilac spores. Habitat: Hardwood, late spring through September.","7":"Ganoderma lucidum, Reishi. Edible mushroom. Benefits: antioxidant, anti-inflammatory, immune support. 3-20cm red-brown fan-shaped, glossy, white pores, stem: chestnut or dark brown, lateral, Brown spores. Habitat: Hardwood, late summer to early autumn.","8":"Tylopilus felleus, bitter bolete. Edible mushroom. 5-13cm brown convex, pink pores, stem: whitish to pale brownish, reticulate, Brownish pink spores. Habitat: Conifer.","9":"Pleurotus ostreatus, oyster mushroom. Edible mushroom. Benefits: antioxidant, heart health, immune support. 5-18cm white to blue-gray convex, white decurrent gills, stem: white, short or absent, White to faintly yellowish or lilac spores. Habitat: Hardwood.","10":"Boletus edulis, cep. Edible mushroom. 5-20cm yellowish-brown convex, absent, stem: white to light brown, bulbous, Olive-brown spores. Habitat: Conifer, oak, June to October.","11":"Tremella fuciformis, snow fungus. Edible mushroom. Benefits: antioxidant, immune support, heart health. up to 7.5cm whitish frond-like, absent. Habitat: Hardwood, after heavy rains.","12":"Hericium erinaceus, lion's mane. Edible mushroom. Benefits: immune support, antibacterial, anti-inflammatory. 8-25cm white clump of soft spines, absent, White spores. Habitat: Wood, late summer\/fall.","13":"Macrolepiota Albuminosa, Termite Mushroom. Edible mushroom. Benefits: immune support, heart health, anti-inflammatory. 3-7cm white to light yellow, absent, stem: ivory white, thick. Habitat: Termite nests, May-October.","14":"Cantharellus cibarius, golden chanterelle. Edible mushroom. up to 10cm yellow funnel-shaped, yellow decurrent ridges, stem: thick, decurrent, Pale yellow to creamy white spores. Habitat: Soil, summer and autumn.","15":"Hypsizygus tessellatus, White beech mushroom. Edible mushroom. 4-8cm whitish convex, whitish attached gills, stem: whitish, White to buff spores. Habitat: Wood, fall.","16":"Pleurotus eryngii, King Trumpet Mushroom. Edible mushroom. Benefits: antioxidant, immune support, heart health. 1-8cm tan to brown convex, white to light brown decurrent gills, stem: white to light brown, White spores. Habitat: Hardwood, late summer to early fall.","17":"Amanita verna, Fool's Mushroom. Poisonous mushroom. Contains alpha-amanitin, phallotoxins causing liver failure, kidney failure, diarrhea. 5-10cm white egg-shaped, white free gills, stem: white, volva, ring, White spores. Habitat: Woodlands, springtime.","18":"Amanita virosa, Death Angel. Poisonous mushroom. Contains alpha-amanitin causing liver failure, vomiting, diarrhea, death. 2.5-12cm white bell-shaped, white free gills, stem: white, volva, ring, White spores. Habitat: Woodlands, summer to autumn.","19":"Amanita phalloides, Death Cap. Poisonous mushroom. Contains amatoxins causing liver failure, vomiting, diarrhea, death. 4-16cm greenish-yellow round, white free gills, stem: white, volva, ring, White spores. Habitat: Hardwood, summer to mid-winter.","20":"Chlorophyllum molybdites, False Parasol. Poisonous mushroom. Causes gastrointestinal, nausea, vomiting, diarrhea. 10-35cm white to brownish convex, white to grayish-green free gills, stem: white to brown, ring, Dull grayish-green spores. Habitat: Lawns, summer to fall.","21":"Lepiota brunneoincarnata, Deadly Dapperling. Poisonous mushroom. Contains alpha-amanitin causing liver damage, nausea, vomiting, death. 2.5-6cm pinkish-brown convex, creamy white free gills, stem: creamy white with pink flush, ring, White spores. Habitat: Grassy areas, July to November.","22":"Amanita muscaria, Fly Agaric. Poisonous mushroom. Contains ibotenic acid, muscimol, muscarine causing hallucination, vomiting, nausea, death. 7-20cm red to orange hemispherical with white flakes, white free gills, stem: white, volva, ring, bulbous, White spores. Habitat: Forests, July to November.","23":"Entoloma sinuatum, Livid Pinkgill. Poisonous mushroom. Causes gastrointestinal, diarrhea, vomiting, death. 6-20cm ivory white convex, yellowish white to pinkish sinuate gills, stem: ivory white, bulbous, Pink spores. Habitat: Woodlands, late summer to autumn.","24":"Panaeolus papilionaceus, bell-capped mottlegill. Poisonous mushroom. Causes hallucination. 1.5-4.0cm gray-brown bell-shaped, pale grey to blackish adnate gills, stem: gray-brown, slender, hollow, Black spores. Habitat: Dung.","25":"Inocybe rimosa, straw-colored fiber head. Poisonous mushroom. Contains muscarine causing poisoning. 2-8cm straw yellow conical, whitish to brownish attached gills, stem: whitish or pale yellowish, Brown spores. Habitat: Hardwoods or conifers, summer and fall.","26":"Coprinopsis atramentaria, Ink cap. Poisonous mushroom. Contains coprine causing nausea, vomiting. 3-10cm gray to gray-brown oval, white to black gills, melting, stem: white, hollow, Black spores. Habitat: Wood, urban areas, spring to autumn.","27":"Psilocybe semilanceata, liberty cap. Poisonous mushroom. Contains psilocybin, psilocin causing hallucination. 0.5-2cm cream-colored, pimple on top, olive-gray to purple-black gills, stem: cream-colored, slender, fibrous, Very dark purple-brown spores. Habitat: Meadows and pastures.","28":"Amanita pantherina, Panther cap. Poisonous mushroom. Contains muscimol, ibotenic acid causing hallucination, confusion, death. 3-18cm brown to tan convex with white warts, white free gills, stem: white, ring, swollen base, White spores. Habitat: Forests, late summer and autumn.","29":"Galerina marginata, funeral bell. Poisonous mushroom. Contains amatoxins causing liver failure, kidney failure, death, vomiting. 1.5-5cm honey-yellow to cinnamon-brown convex, yellowish to rusty brown attached gills, stem: whitish to brownish, ring, Telltale rusty brown spores. Habitat: Wood, year-round.","30":"Pholiotina rugosa, Common Conecap Mushroom. Poisonous mushroom. Contains amatoxins causing liver failure, death. 1-2cm orangish-brown conic, whitish to brownish attached gills, stem: brownish, ring, Yellow-brown spores. Habitat: Woods, urban landscaping, spring and summer.","31":"Scleroderma citrinum, Common Earth Ball. Poisonous mushroom. 4-12cm dirty-yellow to ochre-brown, warty scales, absent. Habitat: Woods, heathland, autumn to winter.","32":"Gyromitra esculenta, Brain mushroom. Poisonous mushroom. Contains gyromitrin causing liver damage, nausea, death. 3-12cm reddish-brown brain-like, absent, stem: pale yellowish-tan, Yellowish buff spores. Habitat: Conifers, spring."}}